HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
        case RBC_MESH_EVENT_TYPE_DFU_NEW_FW_AVAILABLE:
            dfu_request(p_evt->params.dfu.new_fw.dfu_type,
                &p_evt->params.dfu.new_fw.new_fwid,
                (uint32_t*) EXAMPLE_DFU_BANK_ADDR);
            break;

        case RBC_MESH_EVENT_TYPE_DFU_RELAY_REQ:
            dfu_relay(p_evt->params.dfu.relay_req.dfu_type,
                &p_evt->params.dfu.relay_req.fwid);
            break;

        case RBC_MESH_EVENT_TYPE_DFU_START:
        case RBC_MESH_EVENT_TYPE_DFU_END:
            break;
        case RBC_MESH_EVENT_TYPE_DFU_SOURCE_REQ:
            break;
#endif
        default:
            break;
    }
}


/**
* @brief Initialize GPIO pins, for LEDs and debugging
*/
void gpio_init(void)
{
    nrf_gpio_range_cfg_output(LED_START, LED_STOP);

    for (uint32_t i = 0; i < LEDS_NUMBER; ++i)
    {
        nrf_gpio_pin_set(LED_START + i);
    }	
	nrf_gpio_pin_clear(BSP_LED_1);	// LOW LEVEL LED1 ON
	
#if defined(BOARD_LIGHTSWITCH)			
	nrf_gpio_cfg_output(RELAY_OFF);
	nrf_gpio_pin_clear(RELAY_OFF);
	nrf_gpio_cfg_output(RELAY_ON);
	nrf_gpio_pin_clear(RELAY_ON);	
	nrf_gpio_cfg_output(RELAY2_ON);	
	nrf_gpio_pin_clear(RELAY2_ON);
	nrf_gpio_cfg_output(RELAY2_OFF);	
	nrf_gpio_pin_clear(RELAY2_OFF);	
    nrf_gpio_cfg_output(IR_SEND);
	nrf_gpio_pin_clear(IR_SEND);
	nrf_gpio_cfg_input(IR_REC,NRF_GPIO_PIN_PULLUP);		
#endif

#if defined(BOARD_PCA10028) || defined(BOARD_PCA10040)
    #ifdef BUTTONS
        nrf_gpio_cfg_input(BUTTON_1, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_2, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_3, NRF_GPIO_PIN_PULLUP);
        nrf_gpio_cfg_input(BUTTON_4, NRF_GPIO_PIN_PULLUP);
    #endif
#endif
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_0:
		
        case BSP_EVENT_KEY_1:	

		pir_triggle_mode = 0;				/* if key press exit trigger mode */
		app_timer_stop(m_trigger_timer_id);
		
		if(relay_status)
		{			
			relay_status = 0;

#ifdef BREATH_LED			
			update_pwm_value(0x00);
#else			
	
			
			nrf_gpio_pin_set(LED_1);
			nrf_gpio_pin_set(LED_3);				
			
#endif			
			shut_pir_sound_timer();		
			err_code = app_timer_start(m_hang_on_timer_id, KEY_PERIOD_HANG_SENSOR, NULL);			
			APP_ERROR_CHECK(err_code);	

#ifdef RELAY_LATCH	
			relay_off();
			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
			APP_ERROR_CHECK(err_code);	
#else
			relay_off();
#endif			

#ifdef DEBUG_LOG_RTT
			SEGGER_RTT_printf(0, "SWITCH,OFF.\r\n");	
#endif			
		}else
		{
			
			relay_status = 1;
#ifdef BREATH_LED			
			update_pwm_value(100);	
#else			

			nrf_gpio_pin_clear(LED_1);
			nrf_gpio_pin_clear(LED_3);

			
#endif			
#ifdef RELAY_LATCH
			relay_on();
			err_code = app_timer_start(m_relay_timer_id, RELAY_INTERVAL, NULL);
			APP_ERROR_CHECK(err_code);
#else
			relay_on();
#endif
			shut_pir_sound_timer();	
			err_code = app_timer_start(m_hang_on_timer_id, KEY_PERIOD_HANG_SENSOR, NULL);			
			APP_ERROR_CHECK(err_code);
			
#ifdef DEBUG_LOG_RTT
			SEGGER_RTT_printf(0, "SWITCH,ON.\r\n");
#endif
		}		
        break;
        case BSP_EVENT_KEY_2:
				
        break;
        case BSP_EVENT_KEY_3:
				
        break;
        default:
            break;
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

	/* The timer library enables the application to create multiple timer instances based on the RTC1 peripheral. 
		Checking for time-outs and invoking the user time-out handlers is performed in the RTC1 interrupt handler. 
		List handling is done using a software interrupt (SWI0). Both interrupt handlers are running in APP_LOW priority level. */	
    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
		
    // Create timers.
    err_code = app_timer_create(&m_heartbeat_timer_id, APP_TIMER_MODE_REPEATED, led_heartbeat_handler);                                                                
    APP_ERROR_CHECK(err_code);
	// Create relay execute timer.
#ifdef RELAY_LATCH
    err_code = app_timer_create(&m_relay_timer_id, APP_TIMER_MODE_SINGLE_SHOT, relay_execute_handler);                                                                
    APP_ERROR_CHECK(err_code);	
#endif
	
    err_code = app_timer_create(&m_communicate_timer_id, APP_TIMER_MODE_SINGLE_SHOT, blink_off_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
#ifdef BREATH_LED
    err_code = app_timer_create(&m_pwm_update_timer_id, APP_TIMER_MODE_REPEATED, pwm_update_handler);                                                                
    APP_ERROR_CHECK(err_code);
#endif	
    err_code = app_timer_create(&m_motion_sound_timer_id, APP_TIMER_MODE_SINGLE_SHOT, led_off_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_create(&m_pir_mes_timer_id, APP_TIMER_MODE_REPEATED, pir_event_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_create(&m_sound_mes_timer_id, APP_TIMER_MODE_REPEATED, sound_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
		
    err_code = app_timer_create(&m_light_mes_timer_id, APP_TIMER_MODE_REPEATED, light_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_create(&m_temp_mes_timer_id, APP_TIMER_MODE_REPEATED, temperature_event_handler);                                                                
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_create(&m_watchdog_timer_id, APP_TIMER_MODE_REPEATED, watch_dog_handler);                                                                
    APP_ERROR_CHECK(err_code);	

