HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
    err_code = app_timer_create(&m_hang_on_timer_id, APP_TIMER_MODE_SINGLE_SHOT, hang_on_handler);                                                                
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_create(&m_trigger_timer_id, APP_TIMER_MODE_SINGLE_SHOT, trigger_handler);                                                                
    APP_ERROR_CHECK(err_code);	
}
/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_sound_mes_timer_id, SOUND_MES_INTERVAL, NULL);	/* sound detect timer */
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_start(m_watchdog_timer_id, WATCHDOG_INTERVAL, NULL);	/* watchdog feed */
    APP_ERROR_CHECK(err_code);
	
    err_code = app_timer_start(m_heartbeat_timer_id, HEARTBEAT_INTERVAL, NULL);	/* hearybeat timer */
    APP_ERROR_CHECK(err_code);
		
    err_code = app_timer_start(m_pir_mes_timer_id, PIR_MES_INTERVAL, NULL);		/* PIR detect timer */
    APP_ERROR_CHECK(err_code);		
	
    err_code = app_timer_start(m_light_mes_timer_id, LIGHT_MES_INTERVAL, NULL); /* light sensor measurement */
    APP_ERROR_CHECK(err_code);	
	
    err_code = app_timer_start(m_temp_mes_timer_id, TEMP_MES_INTERVAL, NULL);	/* temperature measurement */
    APP_ERROR_CHECK(err_code);


}
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(void)
{
    uint32_t err_code = bsp_init(/*BSP_INIT_LED |*/ BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

}
#ifdef BREATH_LED
void bsp_pwm_init(void)
{
    ret_code_t err_code;
    
    /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(5000L, BSP_LED_0, BSP_LED_2);
    
    /* Switch the polarity of the second channel. */
	pwm1_cfg.pin_polarity[0] = APP_PWM_POLARITY_ACTIVE_HIGH;
    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;	//APP_PWM_POLARITY_ACTIVE_HIGH
    	
    /* Initialize and enable PWM. */
    err_code = app_pwm_init(&PWM1,&pwm1_cfg,NULL);	//pwm_ready_callback
    APP_ERROR_CHECK(err_code);
		
    app_pwm_enable(&PWM1);	
	
	while (app_pwm_channel_duty_set(&PWM1, 0, 100) == NRF_ERROR_BUSY);	
	while (app_pwm_channel_duty_set(&PWM1, 1, 100) == NRF_ERROR_BUSY);
}
#endif
void bsp_wdt_init(void)
{
	uint32_t err_code = NRF_SUCCESS;
	
    //Configure WDT.
	nrf_drv_wdt_config_t config;	
	config.behaviour = NRF_WDT_BEHAVIOUR_PAUSE_SLEEP_HALT;
	config.interrupt_priority = APP_IRQ_PRIORITY_HIGH;
	config.reload_value = 2000;	
	
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();	
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_temp_init_t temp_init;
	ble_light_init_t light_init;
	ble_dis_init_t dis_init;


    /* Initialize Light Sensor Service.*/
    memset(&light_init, 0, sizeof(light_init));

    /* Here the sec level for the light sensor Service can be changed/increased. */
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&light_init.light_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&light_init.light_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&light_init.light_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&light_init.light_level_report_read_perm);

    light_init.evt_handler          = NULL;
    light_init.support_notification = true;
    light_init.p_report_ref         = NULL;
    light_init.initial_light_level   = 100;

    err_code = ble_light_init(&m_light, &light_init);
    APP_ERROR_CHECK(err_code);		
	
	
    /* Initialize Temperature Service.*/
    memset(&temp_init, 0, sizeof(temp_init));

    /* Here the sec level for the Temperature Service can be changed/increased. */
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&temp_init.temperature_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&temp_init.temperature_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&temp_init.temperature_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&temp_init.temperature_level_report_read_perm);

    temp_init.evt_handler          = NULL;
    temp_init.support_notification = true;
    temp_init.p_report_ref         = NULL;
    temp_init.initial_temp_level   = 100;

    err_code = ble_temp_init(&m_temp, &temp_init);
    APP_ERROR_CHECK(err_code);	
	
	
    // Initialize Device Information Service. 
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);
	ble_srv_ascii_to_utf8(&dis_init.model_num_str, (char *)DEVICE_NAME);
	ble_srv_ascii_to_utf8(&dis_init.hw_rev_str, (char *)DEVICE_HARDWARE_VERSION);
	ble_srv_ascii_to_utf8(&dis_init.fw_rev_str, (char *)DEVICE_FIRMWARE_VERSION);
	ble_srv_ascii_to_utf8(&dis_init.sw_rev_str, (char *)DEVICE_SOFTWARE_VERSION);
	ble_srv_ascii_to_utf8(&dis_init.serial_num_str, (char *)DEVICE_SERIAL_NUMBER);
	
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);	
	
}

/** @brief main function */
int main(void)
{		
	
    /* init leds and pins */
    gpio_init();
	/* power on led light on for a while */
	leds_on_for_while();
    /* Initialize timer module.*/
    timers_init();
	/* Initialize button and leds.*/
	buttons_leds_init();
#ifdef BREATH_LED	
	/* Initialize breath led pwm */
	bsp_pwm_init();
#endif	
	/* Initialize adc config.*/
	adc_config();
	/* Initialize wdt modle */
	bsp_wdt_init();
	
#ifdef DEBUG_LOG_RTT	// RTT debug interface.
	SEGGER_RTT_ConfigUpBuffer(0, NULL, NULL, 0, SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL);
	
	SEGGER_RTT_printf(0, "BUILD DATE:[%s %s].\r\n", __DATE__,__TIME__);
	SEGGER_RTT_printf(0, "RESET_REASON:%2x\r\n",(uint16_t)NRF_POWER->RESETREAS);
			
	NRF_POWER->RESETREAS = 0xffffffff;
#endif	
	
    /* Enable Softdevice (including sd_ble before framework */
#ifdef NRF52
    SOFTDEVICE_HANDLER_INIT(&MESH_CLOCK_SOURCE,NULL); 
#else
    SOFTDEVICE_HANDLER_INIT(MESH_CLOCK_SOURCE,NULL); 
#endif    

    softdevice_ble_evt_handler_set(sd_ble_evt_handler); 
	/* app-defined event handler, as we need to send it to the nrf_adv_conn module and the rbc_mesh */
    softdevice_sys_evt_handler_set(rbc_mesh_sd_evt_handler);

#ifdef RBC_MESH_SERIAL
    mesh_aci_init();
#endif   
       
